5c5
< A = @, B = @('-34' => @).
---
> A = @, B = @('-34' => A).
8c8
< A = @, B = @('-34' => @), C = ['-34'].
---
> A = @, B = @('-34' => A), C = ['-34'].
10a11
> A = @, B = @('-34' => A), C = ['-34'].
13c14
< A = @, B = @(34 => @).
---
> A = @, B = @(34 => A).
16c17
< A = @, B = @(34 => @), C = [34].
---
> A = @, B = @(34 => A), C = [34].
19c20
< A = @, B = @(34 => @), C = [34], D = 68.
---
> A = @, B = @(34 => A), C = [34], D = 68.
