5c5
< A = ===(@), X = @.
---
> A = ===(X), X = @.
8c8
< A = ===(@), B = true, X = @.
---
> A = ===(X), B = true, X = @.
10a11
> A = ===(X), X = @.
13c14
< A = ===(@), B = false, X = @.
---
> A = ===(X), B = false, X = @.
15a17
> A = ===(X), X = @.
20c22
< A = ===(2 => @), X = @.
---
> A = ===(2 => X), X = @.
23c25
< A = ===(2 => @), B = false, X = @, Y = @.
---
> A = ===(2 => X), B = false, X = @, Y = @.
25a28
> A = ===(2 => X), X = @.
28c31
< A = ===(2 => @), B = true, X = @.
---
> A = ===(2 => X), B = true, X = @.
30a34
> A = ===(2 => X), X = @.
35c39
< A = ===(@), B = ===(2 => @), X = @.
---
> A = ===(X), B = ===(2 => X), X = @.
38c42
< A = ===(@), B = ===(2 => @), Q = true, R = true, X = @.
---
> A = ===(X), B = ===(2 => X), Q = true, R = true, X = @.
40a45
> A = ===(X), B = ===(2 => X), X = @.
