7c7
< A = @, X = f(@).
---
> A = @, X = f(A).
10c10
< A = @, B = @, X = f(@), Y = f(@,@).
---
> A = @, B = @, X = f(A), Y = f(A,B).
13c13
< A = real~, B = real~, C = real~, X = f(real~), Y = f(real~,real~), Z = real~.
---
> A = real~, B = real~, C = real~, X = f(A), Y = f(A,B), Z = real~.
16c16
< A = 4, B = 5, C = 6, X = f(4), Y = f(4,5), Z = 15.
---
> A = 4, B = 5, C = 6, X = f(A), Y = f(A,B), Z = 15.
18a19
> A = real~, B = real~, C = real~, X = f(A), Y = f(A,B), Z = real~.
20a22
> A = @, B = @, X = f(A), Y = f(A,B).
23c25
< A = @, B = @, C = @, X = f(@), Y = f(@,@), Z = f(@,3 => @).
---
> A = @, B = @, C = @, X = f(A), Y = f(A,B), Z = f(A,3 => C).
26,33c28
< A = real~, 
< B = @, 
< C = real~, 
< W = real~, 
< X = f(real~), 
< Y = f(real~,@), 
< Z = f(real~,3 => real~).
< 
---
> A = real~, B = @, C = real~, W = real~, X = f(A), Y = f(A,B), Z = f(A,3 => C).
36,43c31
< A = 10, 
< B = 45, 
< C = real~, 
< W = real~, 
< X = f(10), 
< Y = f(10,45), 
< Z = f(10,3 => real~).
< 
---
> A = 10, B = 45, C = real~, W = real~, X = f(A), Y = f(A,B), Z = f(A,3 => C).
46c34
< A = 10, B = 45, C = 33, W = 88, X = f(10), Y = f(10,45), Z = f(10,3 => 33).
---
> A = 10, B = 45, C = 33, W = 88, X = f(A), Y = f(A,B), Z = f(A,3 => C).
53,56c41,44
< X = f(10), 
< Y = f(10,45), 
< Z = f(10,3 => 33), 
< Z1 = f(2 => 45,3 => 33).
---
> X = f(A), 
> Y = f(A,B), 
> Z = f(A,3 => C), 
> Z1 = f(2 => B,3 => C).
64,65c52,53
< X = f(10), 
< Y = f(10,45), 
---
> X = f(A), 
> Y = f(A,B), 
67,68c55,56
< Z = f(10,3 => 33), 
< Z1 = f(2 => 45,3 => 33), 
---
> Z = f(A,3 => C), 
> Z1 = f(2 => B,3 => C), 
74c62
< A = @, X = f(@), Y = f(2 => @), Z = f(3 => @).
---
> A = @, X = f(A), Y = f(2 => A), Z = f(3 => A).
79,84c67,72
< X = f(@), 
< X1 = f(@,3 => @), 
< Y = f(2 => @), 
< Y1 = f(@,@), 
< Z = f(3 => @), 
< Z1 = f(2 => @,3 => @).
---
> X = f(A), 
> X1 = f(A,3 => B), 
> Y = f(2 => A), 
> Y1 = f(B,A), 
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A).
91,92c79,80
< X = f(real~~~), 
< X1 = f(real~~~,3 => real~~~), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
94,95c82,83
< Y = f(2 => real~~~), 
< Y1 = f(real~~~,real~~~), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
97,98c85,86
< Z = f(3 => real~~~), 
< Z1 = f(2 => real~~~,3 => real~~~), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
106,107c94,95
< X = f(1), 
< X1 = f(1,3 => 2), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
109,110c97,98
< Y = f(2 => 1), 
< Y1 = f(2,1), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
112,113c100,101
< Z = f(3 => 1), 
< Z1 = f(2 => 2,3 => 1), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
142,143c130,131
< X = f(1), 
< X1 = f(1,3 => 2), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
145,146c133,134
< Y = f(2 => 1), 
< Y1 = f(2,1), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
148,149c136,137
< Z = f(3 => 1), 
< Z1 = f(2 => 2,3 => 1), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
189,190c177,178
< X = f(1), 
< X1 = f(1,3 => 2), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
192,193c180,181
< Y = f(2 => 1), 
< Y1 = f(2,1), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
195,196c183,184
< Z = f(3 => 1), 
< Z1 = f(2 => 2,3 => 1), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
221,222c209,210
< X = f(real~~~), 
< X1 = f(real~~~,3 => real~~~), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
224,225c212,213
< Y = f(2 => real~~~), 
< Y1 = f(real~~~,real~~~), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
227,228c215,216
< Z = f(3 => real~~~), 
< Z1 = f(2 => real~~~,3 => real~~~), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
236,237c224,225
< X = f(1), 
< X1 = f(1,3 => 2), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
239,240c227,228
< Y = f(2 => 1), 
< Y1 = f(2,1), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
242,243c230,231
< Z = f(3 => 1), 
< Z1 = f(2 => 2,3 => 1), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
272,273c260,261
< X = f(1), 
< X1 = f(1,3 => 2), 
---
> X = f(A), 
> X1 = f(A,3 => B), 
275,276c263,264
< Y = f(2 => 1), 
< Y1 = f(2,1), 
---
> Y = f(2 => A), 
> Y1 = f(B,A), 
278,279c266,267
< Z = f(3 => 1), 
< Z1 = f(2 => 2,3 => 1), 
---
> Z = f(3 => A), 
> Z1 = f(2 => B,3 => A), 
