5c5
< A = @, B = @('' => @).
---
> A = @, B = @('' => A).
8c8
< A = [''], B = @('' => ['']).
---
> A = [''], B = @('' => A).
10a11
> A = @, B = @('' => A).
13c14
< A = @, B = @('' => @,0 => 22).
---
> A = @, B = @('' => A,0 => 22).
16c17
< A = ['',0], B = @('' => ['',0],0 => 22).
---
> A = ['',0], B = @('' => A,0 => 22).
18a20
> A = @, B = @('' => A,0 => 22).
20a23
> A = @, B = @('' => A).
25c28
< B = @('' => @), Q = @.
---
> B = @('' => Q), Q = @.
28c31
< B = @(0 => @,'' => @), Q = @, W = @.
---
> B = @('' => Q,0 => W), Q = @, W = @.
30a34
> B = @('' => Q), Q = @.
35c39
< A = s(234 => @), S = @.
---
> A = s(234 => S), S = @.
38c42
< A = s(234 => @), S = @, T = @.
---
> A = s(234 => S), S = @, T = S.
40a45
> A = s(234 => S), S = @.
