10a11
> X = @~.
15a17
> X = @~.
17a20
> X = @~.
19a23
> X = @~.
22c26
< A = @, X = @~, Y = (@ = 1, write(@), fail).
---
> A = @, X = @~, Y = (A = 1, write(A), fail).
24a29
> A = @, X = @~, Y = (A = 1, write(A), fail).
