53c53
< A = a(10,3 => 10), X = 10.
---
> A = a(X,3 => X), X = 10.
56c56
< A = a(10,10,10), X = 10, Y = 10.
---
> A = a(X,X,X), X = 10, Y = X.
59c59
< A = a(10,10,10,foo => 10), X = 10, Y = 10, Z = 10.
---
> A = a(X,X,X,foo => X), X = 10, Y = X, Z = X.
62c62
< A = a(10,10,10,5 => 10,foo => 10), X = 10, Y = 10, Z = 10.
---
> A = a(X,X,X,5 => X,foo => X), X = 10, Y = X, Z = X.
65c65
< A = a(10,10,10,bah,10,foo => 10), X = 10, Y = 10, Z = 10.
---
> A = a(X,X,X,bah,X,foo => X), X = 10, Y = X, Z = X.
116c116
< A = a(10,3 => 10), X = 10.
---
> A = a(X,3 => X), X = 10.
119c119
< A = a(10,10,10), X = 10, Y = 10.
---
> A = a(X,X,X), X = 10, Y = X.
122c122
< A = a(10,10,10,foo => 10), X = 10, Y = 10, Z = 10.
---
> A = a(X,X,X,foo => X), X = 10, Y = X, Z = X.
125c125
< A = a(10,10,10,5 => 10,foo => 10), X = 10, Y = 10, Z = 10.
---
> A = a(X,X,X,5 => X,foo => X), X = 10, Y = X, Z = X.
128c128
< A = a(10,10,10,bah,10,foo => 10), X = 10, Y = 10, Z = 10.
---
> A = a(X,X,X,bah,X,foo => X), X = 10, Y = X, Z = X.
